<?xml version="1.0" ?>
<net batch="1" name="faster_rcnn_nas_lowproposals_coco_2018_01_28" version="6">
	<layers>
		<layer id="0" name="image_tensor" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1200</dim>
					<dim>1200</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Preprocessor/mul/fused_power" precision="FP16" type="Power">
			<data power="1" scale="0.007843137718737125" shift="-1.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1200</dim>
					<dim>1200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1200</dim>
					<dim>1200</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="FirstStageFeatureExtractor/conv0/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="96" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1200</dim>
					<dim>1200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="5184"/>
				<biases offset="5184" size="192"/>
			</blobs>
		</layer>
		<layer id="3" name="FirstStageFeatureExtractor/cell_stem_0/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="FirstStageFeatureExtractor/cell_stem_0/1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5376" size="8064"/>
				<biases offset="13440" size="84"/>
			</blobs>
		</layer>
		<layer id="5" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/left/MaxPool2D/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="7,7" output="96" pads_begin="3,3" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13524" size="9408"/>
			</blobs>
		</layer>
		<layer id="8" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="22932" size="8064"/>
				<biases offset="30996" size="84"/>
			</blobs>
		</layer>
		<layer id="9" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="42" kernel="7,7" output="42" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31080" size="4116"/>
			</blobs>
		</layer>
		<layer id="11" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="35196" size="3528"/>
				<biases offset="38724" size="84"/>
			</blobs>
		</layer>
		<layer id="12" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/left/AvgPool2D/AvgPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="avg" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="5,5" output="96" pads_begin="2,2" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="38808" size="4800"/>
			</blobs>
		</layer>
		<layer id="16" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="43608" size="8064"/>
				<biases offset="51672" size="84"/>
			</blobs>
		</layer>
		<layer id="17" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="42" kernel="5,5" output="42" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="51756" size="2100"/>
			</blobs>
		</layer>
		<layer id="19" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="53856" size="3528"/>
				<biases offset="57384" size="84"/>
			</blobs>
		</layer>
		<layer id="20" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="42" kernel="5,5" output="42" pads_begin="2,2" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="57468" size="2100"/>
			</blobs>
		</layer>
		<layer id="23" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="59568" size="3528"/>
				<biases offset="63096" size="84"/>
			</blobs>
		</layer>
		<layer id="24" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="42" kernel="5,5" output="42" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="63180" size="2100"/>
			</blobs>
		</layer>
		<layer id="26" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="65280" size="3528"/>
				<biases offset="68808" size="84"/>
			</blobs>
		</layer>
		<layer id="27" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="7,7" output="96" pads_begin="3,3" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="68892" size="9408"/>
			</blobs>
		</layer>
		<layer id="29" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="78300" size="8064"/>
				<biases offset="86364" size="84"/>
			</blobs>
		</layer>
		<layer id="30" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="42" kernel="7,7" output="42" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="86448" size="4116"/>
			</blobs>
		</layer>
		<layer id="32" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="90564" size="3528"/>
				<biases offset="94092" size="84"/>
			</blobs>
		</layer>
		<layer id="33" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_3/right/AvgPool2D/AvgPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_3/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="42" kernel="3,3" output="42" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="94176" size="756"/>
			</blobs>
		</layer>
		<layer id="38" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="94932" size="3528"/>
				<biases offset="98460" size="84"/>
			</blobs>
		</layer>
		<layer id="39" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="42" kernel="3,3" output="42" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="98544" size="756"/>
			</blobs>
		</layer>
		<layer id="41" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="99300" size="3528"/>
				<biases offset="102828" size="84"/>
			</blobs>
		</layer>
		<layer id="42" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/right/MaxPool2D/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="FirstStageFeatureExtractor/cell_stem_0/cell_output/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="FirstStageFeatureExtractor/cell_0/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="FirstStageFeatureExtractor/cell_0/AvgPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>168</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="FirstStageFeatureExtractor/cell_0/path1_conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="102912" size="28224"/>
				<biases offset="131136" size="168"/>
			</blobs>
		</layer>
		<layer id="48" name="FirstStageFeatureExtractor/cell_0/Pad/Conv_" precision="FP16" type="Convolution">
			<data dilations="1,1" group="168" kernel="1,1" output="168" pads_begin="0,0" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>168</dim>
					<dim>301</dim>
					<dim>301</dim>
				</port>
			</output>
			<blobs>
				<weights offset="131304" size="336"/>
			</blobs>
		</layer>
		<layer id="49" name="FirstStageFeatureExtractor/cell_0/strided_slice/Crop_" precision="FP16" type="Crop">
			<data axis="2,3" dim="300,300" offset="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>301</dim>
					<dim>301</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="FirstStageFeatureExtractor/cell_0/AvgPool_1" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>168</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="FirstStageFeatureExtractor/cell_0/path2_conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="131640" size="28224"/>
				<biases offset="159864" size="168"/>
			</blobs>
		</layer>
		<layer id="52" name="FirstStageFeatureExtractor/cell_0/final_path_bn/FusedBatchNorm" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>168</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="FirstStageFeatureExtractor/cell_stem_1/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="FirstStageFeatureExtractor/cell_stem_1/1x1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>168</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="160032" size="28224"/>
				<biases offset="188256" size="168"/>
			</blobs>
		</layer>
		<layer id="55" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/left/MaxPool2D/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="FirstStageFeatureExtractor/cell_stem_1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="FirstStageFeatureExtractor/cell_stem_1/AvgPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="FirstStageFeatureExtractor/cell_stem_1/path1_conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="188424" size="8064"/>
				<biases offset="196488" size="84"/>
			</blobs>
		</layer>
		<layer id="59" name="FirstStageFeatureExtractor/cell_stem_1/Pad/Conv_" precision="FP16" type="Convolution">
			<data dilations="1,1" group="96" kernel="1,1" output="96" pads_begin="0,0" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>600</dim>
					<dim>600</dim>
				</port>
			</output>
			<blobs>
				<weights offset="196572" size="192"/>
			</blobs>
		</layer>
		<layer id="60" name="FirstStageFeatureExtractor/cell_stem_1/strided_slice/Crop_" precision="FP16" type="Crop">
			<data axis="2,3" dim="599,599" offset="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>600</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="FirstStageFeatureExtractor/cell_stem_1/AvgPool_1" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>599</dim>
					<dim>599</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="FirstStageFeatureExtractor/cell_stem_1/path2_conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="42" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<weights offset="196764" size="8064"/>
				<biases offset="204828" size="84"/>
			</blobs>
		</layer>
		<layer id="63" name="FirstStageFeatureExtractor/cell_stem_1/final_path_bn/FusedBatchNorm" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>42</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="7,7" output="84" pads_begin="2,2" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="204912" size="8232"/>
			</blobs>
		</layer>
		<layer id="66" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="213144" size="14112"/>
				<biases offset="227256" size="168"/>
			</blobs>
		</layer>
		<layer id="67" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="7,7" output="84" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="227424" size="8232"/>
			</blobs>
		</layer>
		<layer id="69" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="235656" size="14112"/>
				<biases offset="249768" size="168"/>
			</blobs>
		</layer>
		<layer id="70" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/left/AvgPool2D/AvgPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="avg" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="5,5" output="84" pads_begin="1,1" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="249936" size="4200"/>
			</blobs>
		</layer>
		<layer id="74" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="254136" size="14112"/>
				<biases offset="268248" size="168"/>
			</blobs>
		</layer>
		<layer id="75" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="5,5" output="84" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="268416" size="4200"/>
			</blobs>
		</layer>
		<layer id="77" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="272616" size="14112"/>
				<biases offset="286728" size="168"/>
			</blobs>
		</layer>
		<layer id="78" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/left/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/left/separable_5x5_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="5,5" output="84" pads_begin="1,1" pads_end="2,2" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="286896" size="4200"/>
			</blobs>
		</layer>
		<layer id="81" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/left/separable_5x5_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="291096" size="14112"/>
				<biases offset="305208" size="168"/>
			</blobs>
		</layer>
		<layer id="82" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/left/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/left/separable_5x5_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="5,5" output="84" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="305376" size="4200"/>
			</blobs>
		</layer>
		<layer id="84" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/left/separable_5x5_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="309576" size="14112"/>
				<biases offset="323688" size="168"/>
			</blobs>
		</layer>
		<layer id="85" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="7,7" output="84" pads_begin="2,2" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="323856" size="8232"/>
			</blobs>
		</layer>
		<layer id="87" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="332088" size="14112"/>
				<biases offset="346200" size="168"/>
			</blobs>
		</layer>
		<layer id="88" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/Relu_1" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="84" kernel="7,7" output="84" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="346368" size="8232"/>
			</blobs>
		</layer>
		<layer id="90" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="84" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="354600" size="14112"/>
				<biases offset="368712" size="168"/>
			</blobs>
		</layer>
		<layer id="91" name="FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/combine/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>84</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
